# impute using sklearn

In [1]:
# import libraries 
import pandas as pd 
import numpy as np
import seaborn as sns 
from sklearn.impute import SimpleImputer

# The  use of SimpleImputer 
### The SimpleImputer is used in data preprocessing to handle missing values in a dataset. Many machine learning algorithms cannot work with missing data, so we need to fill or "impute" those missing values before training a model.

In [2]:
# load a data set 
df= sns.load_dataset('titanic')
df.head()

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
0,0,3,male,22.0,1,0,7.2500,S,Third,man,True,NaN,Southampton,no,False
1,1,1,female,38.0,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False
2,1,3,female,26.0,0,0,7.9250,S,Third,woman,False,NaN,Southampton,yes,True
3,1,1,female,35.0,1,0,53.1000,S,First,woman,False,C,Southampton,yes,False
4,0,3,male,35.0,0,0,8.0500,S,Third,man,True,NaN,Southampton,no,True

In [3]:
# impute the simpleImputer from sklearn 
imputer = SimpleImputer(strategy='mean')
df['age']= imputer.fit_transform(df[['age']])

# SimplerImputer is also univariate 
## "Univariate" means that each column is treated independently, without considering other columns in the dataset.

In [4]:
df.isnull().sum().sort_values(ascending=False)

deck           688
embarked         2
embark_town      2
age              0
survived         0
pclass           0
sex              0
fare             0
parch            0
sibsp            0
class            0
adult_male       0
who              0
alive            0
alone            0
dtype: int64

# Multivariate means estimate on the bassis of other columns

In [5]:
from sklearn.experimental import enable_iterative_imputer
from sklearn .impute import IterativeImputer
# impute the age column using iterative imputer 
imputer= IterativeImputer(max_iter=20, n_nearest_features=5)
df['age']= imputer.fit_transform(df[['age']])

In [6]:
df.isnull().sum().sort_values(ascending=False)

deck           688
embarked         2
embark_town      2
age              0
survived         0
pclass           0
sex              0
fare             0
parch            0
sibsp            0
class            0
adult_male       0
who              0
alive            0
alone            0
dtype: int64

# mutivariate  is more efficient then univariate

# filling missing values using forward and backword fil

In [7]:
df['embark_town']= df['embark_town'].ffill()
df.isnull().sum().sort_values(ascending=False)

deck           688
embarked         2
survived         0
age              0
sibsp            0
pclass           0
sex              0
fare             0
parch            0
who              0
class            0
adult_male       0
embark_town      0
alive            0
alone            0
dtype: int64

# uisng  KNN imputer

In [13]:
from sklearn. impute import KNNImputer
imputer= KNNImputer(n_neighbors=5)
df['age']= imputer.fit_transform(df[['age']])

In [8]:
df['embarked']=df['embarked'].bfill()
df.isnull().sum().sort_values(ascending=False)

deck           688
pclass           0
survived         0
age              0
sibsp            0
parch            0
sex              0
fare             0
embarked         0
who              0
class            0
adult_male       0
embark_town      0
alive            0
alone            0
dtype: int64

In [9]:
df.columns

Index(['survived', 'pclass', 'sex', 'age', 'sibsp', 'parch', 'fare',
       'embarked', 'class', 'who', 'adult_male', 'deck', 'embark_town',
       'alive', 'alone'],
      dtype='object')

In [10]:
df.drop('deck', axis=1, inplace=True)

In [11]:
df

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,embark_town,alive,alone
0,0,3,male,22.000000,1,0,7.2500,S,Third,man,True,Southampton,no,False
1,1,1,female,38.000000,1,0,71.2833,C,First,woman,False,Cherbourg,yes,False
2,1,3,female,26.000000,0,0,7.9250,S,Third,woman,False,Southampton,yes,True
3,1,1,female,35.000000,1,0,53.1000,S,First,woman,False,Southampton,yes,False
4,0,3,male,35.000000,0,0,8.0500,S,Third,man,True,Southampton,no,True
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
886,0,2,male,27.000000,0,0,13.0000,S,Second,man,True,Southampton,no,True
887,1,1,female,19.000000,0,0,30.0000,S,First,woman,False,Southampton,yes,True
888,0,3,female,29.699118,1,2,23.4500,S,Third,woman,False,Southampton,no,False
889,1,1,male,26.000000,0,0,30.0000,C,First,man,True,Cherbourg,yes,True
890,0,3,male,32.000000,0,0,7.7500,Q,Third,man,True,Queenstown,no,True

In [12]:
df.columns

Index(['survived', 'pclass', 'sex', 'age', 'sibsp', 'parch', 'fare',
       'embarked', 'class', 'who', 'adult_male', 'embark_town', 'alive',
       'alone'],
      dtype='object')